app/controllers/employees_controller.rb

 def create
  @employee = Employee.create(employee_params)
---
INSERT INTO "employees" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-01-30 11:56:03.098260"], ["name", "Andy Bool"], ["updated_at", "2015-01-30 11:56:03.098260"]]

 def show
   @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
   @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
    @employee = Employee.find(params[:article_id])
    @address = @employee.address.find(params[:id])
    @address.destroy
---
SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "addresses".* FROM "addresses"  WHERE "addresses"."employee_id" = $1 LIMIT 1  [["employee_id", 1]]
DELETE FROM "employees" WHERE "employees"."id" = $1  [["id", 1]]